In [64]:
import os
import pandas as pd
import numpy as np
import mysql.connector
import datetime
import pymysql
connection = mysql.connector.connect(host = 'replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com',
                                    user = 'kwik_analyst',
                                    passwd = 'rnXZT3El39g6IjVq:',
                                    db = 'kwik_views')

In [8]:
connection

In [9]:
from pandas.io import gbq

In [41]:
kwiksuccess.to_gbq(destination_table = 'dwh.successorder',project_id = 'kwikbi',if_exists = 'replace')
kwikfailed.to_gbq(destination_table = 'dwh.failed',project_id = 'kwikbi',if_exists = 'replace')
kwikvendor.to_gbq(destination_table = 'dwh.vendor',project_id = 'kwikbi',if_exists = 'replace')
kwikfleet.to_gbq(destination_table = 'dwh.fleet',project_id = 'kwikbi',if_exists = 'replace')
kwikjobtypesuccess.to_gbq(destination_table = 'dwh.jobtypesuccess',project_id = 'kwikbi',if_exists = 'replace')
finaljobtype.to_gbq(destination_table = 'dwh.testjobtype',project_id = 'kwikbi',if_exists = 'replace')

1it [01:00, 60.09s/it]

In [ ]:
kwikjobtypesuccess.to_gbq(destination_table = 'dwh.jobtypesuccess',project_id = 'kwikbi',if_exists = 'replace')

In [22]:
finaljobtype.to_gbq(destination_table = 'dwh.testjobtype',project_id = 'kwikbi',if_exists = 'replace')

1it [00:07,  7.44s/it]

In [ ]:
vendore = pd.read_csv('vendorelevendec.csv', error_bad_lines=False)

In [ ]:
kwiksuccess

In [ ]:
kwikfailed

In [ ]:
kwikvendor

In [ ]:
kwikfleet

In [ ]:
kwikjobtypesuccess

In [25]:
QUERY = """
SELECT
*
FROM 
`kwikbi.dwh.order_data`
"""

In [56]:
QUERY1 = """
SELECT
*
FROM 
``kwikbi.analytics_190725145.newanalytics`
"""

In [ ]:
pd.concat([dfa, dfb])

In [10]:
from google.cloud import bigquery

In [24]:
bigquery_client = bigquery.Client()

In [26]:
newquery_job = bigquery_client.query(QUERY)

In [27]:
march = newquery_job.to_dataframe()

In [28]:
marchunik = march.drop_duplicates(subset=['unique_order_id'])

In [ ]:
df = df.drop_duplicates(subset=['Id'], keep='last')

In [ ]:
df = df.drop_duplicates(subset=['Id'])

In [22]:
uniqueId = df["Id"].unique()

RangeIndex(start=0, stop=20, step=1)

In [ ]:
 %load_ext sql
connect = "mysql+mysqldb://kwik_analyst:rnXZT3El39g6IjVq:@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views"
%sql $connect

In [10]:
cnxtwo = mysql.connector.connect(user ='root', password='bayo1990',host='35.230.129.146', database='best')

cursor = cnxtwo.cursor()

In [15]:
success = %sql select unique_order_id, arrived_datetime, started_datetime, completed_datetime, acknowledged_datetime, creation_datetime, job_pickup_datetime, job_delivery_datetime, job_pickup_latitude, job_pickup_longitude, created_by, order_id, job_id, job_date, fleet_id, job_status, job_latitude, job_longitude, total_amount, pricing_amount FROM tb_jobs inner join tb_task_view on tb_jobs.pickup_delivery_relationship = tb_task_view.pickup_delivery_relationship where task_status = 2

 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
115786 rows affected.

In [61]:
failed = %sql select unique_order_id, arrived_datetime, started_datetime, completed_datetime, acknowledged_datetime, creation_datetime, job_pickup_datetime, job_delivery_datetime, job_pickup_latitude, job_pickup_longitude, created_by, order_id, job_id, job_date, fleet_id, job_status, job_latitude, job_longitude, total_amount, pricing_amount FROM tb_jobs where job_status != 2
vendor = %sql select vendor_id, customer_id, customer_type, creation_datetime, last_login_date_time, device_type, customer_type FROM tb_vendors
fleet = %sql select fleet_id, creation_datetime, last_login_datetime, location_update_datetime, is_active, is_available, total_tasks_completed_in_week FROM tb_fleets
jobtype = %sql select job_type, job_id, user_id FROM tb_jobs

 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
21284 rows affected.
 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
37140 rows affected.
 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
2307 rows affected.
 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
137213 rows affected.

In [ ]:
sucessorder = []
for row in success:
    value = (row[0],row[1],row[2],row[3],row[4],row[5],row[6],row[7],row[8],row[9],row[10],row[11],row[12],row[13],row[14],row[15],row[16],row[17],row[18],row[18])
    sucessorder.append(value)
    
failedorder = []
for row in failed:
    value = (row[0],row[1],row[2],row[3],row[4],row[5],row[6],row[7],row[8],row[9],row[10],row[11],row[12],row[13],row[14],row[15],row[16],row[17],row[18],row[18])
    failedorder.append(value)

allvendor = []
for row in vendor:
    value = (row[0],row[1],row[2],row[3],row[4],row[5],row[6])
    allvendor.append(value)

allfleet = []
for row in fleet:
    value = (row[0],row[1],row[2],row[3],row[4],row[5],row[6])
    allfleet.append(value)
    
alljobtype = []
for row in jobtype:
    value = (row[0],row[1],row[2])
    alljobtype.append(value)

In [60]:
finalsuccess = pd.DataFrame(sucessorder, columns=["unique_order_id", "arrived", "started", "completed", "acknowledged", "creation", "pickuptime", "deliverytime", "pickup_latitude", "pickup_longitude", "created_by", "vendor_id", "job_id", "job_date", "fleet_id", "job_status", "job_latitude", "job_longitude", "total_amount", "pricing_amount"])
finalfailed = pd.DataFrame(failedorder, columns=["unique_order_id", "arrived", "started", "completed", "acknowledged", "creation", "pickuptime", "deliverytime", "pickup_latitude", "pickup_longitude", "created_by", "vendor_id", "task_id", "job_date", "fleet_id", "job_status", "job_latitude", "job_longitude", "total_amount", "pricing_amount"])
finalvendor = pd.DataFrame(allvendor, columns=["vendor_id", "customer_id", "customer_type", "created", "last_login", "device_type", "customer_type"])
finalfleet = pd.DataFrame(allfleet, columns=["fleet_id", "created", "last_login", "location_time", "active", "available", "total_tasks"])
finaljobtype = pd.DataFrame(alljobtype, columns=["job_type", "job_id","user_id" ])

In [79]:
rowcolumn = finalsuccess[finalsuccess['deliverytime'].isnull()]

In [80]:

rowcolumn

,unique_order_id,arrived,started,completed,acknowledged,creation,pickuptime,deliverytime,pickup_latitude,pickup_longitude,created_by,vendor_id,job_id,job_date,fleet_id,job_status,job_latitude,job_longitude,total_amount,pricing_amount
0,1AA000,2019-06-14 13:15:01,2019-06-14 13:14:58,2019-06-14 13:15:01,2019-06-14 13:14:51,2019-06-14 13:14:47,2019-06-14 18:44:00,NaT,30.7333148,76.7794179,3,5,1,2019-06-14,1.0,2,30.7333148,76.7794179,90.00,90.00
1,3AA000,2019-06-14 13:17:40,2019-06-14 13:17:28,2019-06-14 13:17:40,2019-06-14 13:17:18,2019-06-14 13:17:15,2019-06-14 18:47:00,NaT,30.7333148,76.7794179,3,5,3,2019-06-14,1.0,2,30.7333148,76.7794179,90.00,90.00
2,5AA000,2019-06-14 13:22:59,2019-06-14 13:22:32,2019-06-14 13:22:59,2019-06-14 13:22:27,2019-06-14 13:22:16,2019-06-14 18:58:00,NaT,30.7333148,76.7794179,4,1,5,2019-06-14,1.0,2,30.7333148,76.7794179,70.00,70.00
4,7AA000,2019-06-17 05:42:13,2019-06-17 05:41:27,2019-06-17 05:42:13,2019-06-17 05:41:11,2019-06-17 05:40:50,2019-06-17 11:15:00,NaT,30.7333148,76.7794179,4,1,7,2019-06-17,1.0,2,30.7333148,76.7794179,70.00,70.00
6,9AA000,2019-06-17 06:31:36,2019-06-17 06:30:57,2019-06-17 06:31:36,2019-06-17 06:29:58,2019-06-17 06:28:04,2019-06-17 12:02:00,NaT,30.7333148,76.7794179,4,1,9,2019-06-17,1.0,2,30.7333148,76.7794179,70.00,70.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115776,137149CL298,2021-03-18 10:31:40,2021-03-18 10:31:37,2021-03-18 10:54:58,2021-03-18 10:31:29,2021-03-18 10:31:04,2021-03-18 11:42:00,NaT,6.5024836,3.3434568,4,361,137149,2021-03-18,1041.0,2,6.5024836,3.3434568,2500.00,2500.00
115778,137153CL300,2021-03-18 11:15:53,2021-03-18 10:35:40,2021-03-18 11:18:40,2021-03-18 10:35:26,2021-03-18 10:32:52,2021-03-18 11:44:00,NaT,6.526776,3.3849411,4,35794,137153,2021-03-18,1457.0,2,6.526776,3.3849411,1900.00,1900.00
115780,137157CL302,2021-03-18 11:47:21,2021-03-18 11:17:27,2021-03-18 11:47:24,2021-03-18 11:17:09,2021-03-18 10:35:57,2021-03-18 11:47:00,NaT,6.5747138,3.3377567,4,36165,137157,2021-03-18,1493.0,2,6.5747138,3.3377567,1100.00,1100.00
115782,137161CL304,2021-03-18 11:25:10,2021-03-18 10:40:44,2021-03-18 11:25:12,2021-03-18 10:40:00,2021-03-18 10:39:51,2021-03-18 11:51:00,NaT,6.5519462,3.3253932,4,35463,137161,2021-03-18,1632.0,2,6.5519462,3.3253932,2000.00,2000.00
115784,137173CL310,2021-03-18 11:36:54,2021-03-18 11:30:16,2021-03-18 11:42:59,2021-03-18 11:30:00,2021-03-18 10:57:30,2021-03-18 12:09:00,NaT,6.451700499999999,3.4788894,4,14664,137173,2021-03-18,1111.0,2,6.451700499999999,3.4788894,600.00,600.00

In [62]:
finalsuccess['job_id']=finalsuccess['job_id'].astype(str)
finaljobtype['job_id']=finaljobtype['job_id'].astype(str)
left = pd.DataFrame(finalsuccess)
right = pd.DataFrame(finaljobtype)
jobtypesuccess = pd.merge(left,right,how ='inner', on ='job_id')

In [44]:
firstjobtypesuccess = jobtypesuccess.drop_duplicates(subset=['unique_order_id'])

In [57]:
play = firstjobtypesuccess[firstjobtypesuccess.creation != '0000-00-00 00:00:00']
playe = play[play.started != '0000-00-00 00:00:00']
player = playe[playe.arrived != '0000-00-00 00:00:00']
playere = player[player.completed != '0000-00-00 00:00:00']
playerer = playere[playere.acknowledged != '0000-00-00 00:00:00']
playererer = playerer[playerer.pickuptime != '0000-00-00 00:00:00']
playera = playererer[playererer.deliverytime != '0000-00-00 00:00:00']

In [65]:
playera

,unique_order_id,arrived,started,completed,acknowledged,creation,pickuptime,deliverytime,pickup_latitude,pickup_longitude,...,job_id,job_date,fleet_id,job_status,job_latitude,job_longitude,total_amount,pricing_amount,job_type,user_id
0,1AA000,2019-06-14 13:15:01,2019-06-14 13:14:58,2019-06-14 13:15:01,2019-06-14 13:14:51,2019-06-14 13:14:47,2019-06-14 18:44:00,NaT,30.7333148,76.7794179,...,1,2019-06-14,1.0,2,30.7333148,76.7794179,90.00,90.00,0,1
1,3AA000,2019-06-14 13:17:40,2019-06-14 13:17:28,2019-06-14 13:17:40,2019-06-14 13:17:18,2019-06-14 13:17:15,2019-06-14 18:47:00,NaT,30.7333148,76.7794179,...,3,2019-06-14,1.0,2,30.7333148,76.7794179,90.00,90.00,0,1
2,5AA000,2019-06-14 13:22:59,2019-06-14 13:22:32,2019-06-14 13:22:59,2019-06-14 13:22:27,2019-06-14 13:22:16,2019-06-14 18:58:00,NaT,30.7333148,76.7794179,...,5,2019-06-14,1.0,2,30.7333148,76.7794179,70.00,70.00,0,1
4,7AA000,2019-06-17 05:42:13,2019-06-17 05:41:27,2019-06-17 05:42:13,2019-06-17 05:41:11,2019-06-17 05:40:50,2019-06-17 11:15:00,NaT,30.7333148,76.7794179,...,7,2019-06-17,1.0,2,30.7333148,76.7794179,70.00,70.00,0,1
6,9AA000,2019-06-17 06:31:36,2019-06-17 06:30:57,2019-06-17 06:31:36,2019-06-17 06:29:58,2019-06-17 06:28:04,2019-06-17 12:02:00,NaT,30.7333148,76.7794179,...,9,2019-06-17,1.0,2,30.7333148,76.7794179,70.00,70.00,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115776,137149CL298,2021-03-18 10:31:40,2021-03-18 10:31:37,2021-03-18 10:54:58,2021-03-18 10:31:29,2021-03-18 10:31:04,2021-03-18 11:42:00,NaT,6.5024836,3.3434568,...,137149,2021-03-18,1041.0,2,6.5024836,3.3434568,2500.00,2500.00,0,1
115778,137153CL300,2021-03-18 11:15:53,2021-03-18 10:35:40,2021-03-18 11:18:40,2021-03-18 10:35:26,2021-03-18 10:32:52,2021-03-18 11:44:00,NaT,6.526776,3.3849411,...,137153,2021-03-18,1457.0,2,6.526776,3.3849411,1900.00,1900.00,0,1
115780,137157CL302,2021-03-18 11:47:21,2021-03-18 11:17:27,2021-03-18 11:47:24,2021-03-18 11:17:09,2021-03-18 10:35:57,2021-03-18 11:47:00,NaT,6.5747138,3.3377567,...,137157,2021-03-18,1493.0,2,6.5747138,3.3377567,1100.00,1100.00,0,1
115782,137161CL304,2021-03-18 11:25:10,2021-03-18 10:40:44,2021-03-18 11:25:12,2021-03-18 10:40:00,2021-03-18 10:39:51,2021-03-18 11:51:00,NaT,6.5519462,3.3253932,...,137161,2021-03-18,1632.0,2,6.5519462,3.3253932,2000.00,2000.00,0,1
115784,137173CL310,2021-03-18 11:36:54,2021-03-18 11:30:16,2021-03-18 11:42:59,2021-03-18 11:30:00,2021-03-18 10:57:30,2021-03-18 12:09:00,NaT,6.451700499999999,3.4788894,...,137173,2021-03-18,1111.0,2,6.451700499999999,3.4788894,600.00,600.00,0,1

In [67]:
parah = playera["deliverytime"]

In [72]:
testrial = playera[playera.deliverytime == '00000']

In [74]:
freestyle = pd.notnull(playera["deliverytime"])

In [77]:
rowcolumn = playera[playera['deliverytime'].isnull()]

In [55]:
opee["created_hour"] = opee["created_datetime"].dt.hour
opee["deliver_min"] = opee["recreate_deliver"].dt.minute

In [ ]:
moraly['day_year'] = pd.to_datetime(moraly['job_date']).dt.to_period('D')

In [ ]:
moraly['monthy'] = pd.to_datetime(moraly['job_date_utc']).dt.to_period('M')

In [ ]:
moraly['momo'] = pd.DatetimeIndex(moraly['job_date']).month

In [ ]:
opee["created_hour"] = opee["created_datetime"].dt.hour

In [21]:
opee["deliver_min"] = opee["recreate_deliver"].dt.minute

In [35]:
opee['pick_hour_diff'] = opee['pick_hour'] - opee['created_hour']

In [ ]:
opee['final_deliver_hour_min'] = opee['deliver_hour_diff'] * 60

In [ ]:
opee['total_pick_min_diff'] = opee['final_pick_hour_min'] + opee['pick_min_diff']

In [ ]:
play = tobi[tobi.job_pickup_datetime != '0000-00-00 00:00:00']

In [ ]:
mlog = malog[malog['Card Type'] == "mastercard DEBIT"]

In [16]:
realtobyone17 = tobiriderone.groupby('fleet_id').count()

In [20]:
queryall = "insert into best(red,green,yellow) values (%s,%s,%s)"

In [21]:
cursor.executemany(queryall, all_value)
cnxtwo.commit()

In [ ]:
bayorplay = pd.read_sql_query("select * from tb_jobs;",connection)

In [28]:
bayotrial = pd.read_sql_query("select * from tb_task_view where task_status = 2;",connection)

In [30]:
bayorplaz = pd.read_sql_query('select arrived_datetime, started_datetime, completed_datetime, acknowledged_datetime, creation_datetime, job_pickup_datetime, job_delivery_datetime, job_pickup_latitude, job_pickup_longitude, created_by, order_id, job_id, job_date, unique_order_id, job_type, fleet_id, job_status, user_id, job_latitude, job_longitude, unique_order_id, total_amount, pricing_amount, pickup_delivery_relationship from tb_jobs;',connection)

In [ ]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')

In [64]:
from sqlalchemy import create_engine

In [35]:
tobai= pd.read_csv('tobiexport.csv')

In [36]:
tobtob = pd.DataFrame(tobai)

In [33]:
marchall = marchunik[marchunik['month'] == "2021-03"]

In [30]:
marchunik['month'] = pd.to_datetime(marchunik['job_date']).dt.to_period('M')

In [22]:
tobtob['year'] = pd.DatetimeIndex(tobtob['creation_datetime']).year

In [27]:
free = tobtob[tobtob['year'] != 2019]

In [114]:
tobally = free[(free['creater'] > '2020-10') & (free['creater'] < '2021-03')]

In [105]:
tobary = free[(free['creater'] > '2020-10') & (free['creater'] < '2020-12')]

In [95]:
tobar.to_csv('novem.csv', index = False)

In [31]:
extract = toball['vendor_id']

In [117]:
left = pd.DataFrame(tobally)

In [37]:
tobtob['vendor_id']=tobtob['vendor_id'].astype(str)

In [ ]:
(real.dtypes)

In [62]:
real = pd.DataFrame(right)

In [68]:
left['vendor_id']=left['vendor_id'].astype(str)

In [69]:
real['vendor_id']=real['vendor_id'].astype(str)

In [ ]:
right[right.vendor_id != 'YR']

In [ ]:
right[right['vendor_id'].str.contains('YR', na=False)

In [39]:
left = pd.DataFrame(marchall)

In [40]:
right = pd.DataFrame(tobtob)

In [56]:
newdf = right[right['vendor_id'] != 'YR-....,0']

In [42]:
quicktobi = pd.merge(left,right,how ='inner', on ='vendor_id')

In [74]:
viral['month'] = pd.to_datetime(viral['job_date']).dt.to_period('M')

In [44]:
quicktobi.to_csv('sereren.csv', index = False)

In [76]:
mongo = viral[['vendor_id', 'total_amount','month']]

In [83]:
freedom = mongo.groupby('vendor_id')['total_amount'].sum()

In [65]:
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://kwik_analyst:rnXZT3El39g6IjVq:@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views')

In [ ]:
df = df.drop_duplicates(subset=['Id'])

In [ ]:
toby.to_gbq(destination_table = 'real_estate.greece_data',project_id = '',if_exists = '')

In [18]:
import sqlite3

In [19]:
import sys

In [ ]:
from google.cloud import storage

In [26]:
import sqlite3
import pandas as pd
import numpy as np
from datetime import datetime
import mysql.connector
import sys

In [15]:
cnxtwo = mysql.connector.connect(user ='root', password='bayo1990',host='35.230.129.146', database='guestbook')

cursor = cnxtwo.cursor()

In [81]:
cursor = cnxtwo.cursor()
cursor.execute('insert into entries values (1,10,25)')
cnxtwo.commit()

In [27]:
query1 = ("select * from entries")
cursor.execute(query1)

In [28]:
frame = pd.DataFrame(cursor.fetchall())

In [29]:
frame

              0            1   2
0   first guest  I got here!   1
1  second guest      Me too!   2
2             1           10  15
3             1           10  25

In [ ]:
query3 = ("INSERT INTO entries(order_id, job_id)")

In [62]:
tablename = "UserVitals"

In [59]:
finaley = pd.DataFrame(data=bayore)

In [43]:
from pandas.io import sql
import MySQLdb

In [47]:
concloud = MySQLdb.connect(user ='root', password='bayo1990',host='35.230.129.146', database='guestbook')

In [39]:
list(frame.columns.values)

[0, 1, 2]

In [ ]:
temp = 0
for i in range(len(dfee));
query2 = ("INSERT INTO ")

In [ ]:
%%sql
INSERT INTO entries()

In [8]:
%%sql   
CREATE TABLE sereney
(
 job_field smallint NOT NULL,
 creator smallint  NOT NULL
);

 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
(MySQLdb._exceptions.OperationalError) (1290, 'The MySQL server is running with the --read-only option so it cannot execute this statement')
[SQL: CREATE TABLE sereney (
 job_field smallint NOT NULL,
 creator smallint  NOT NULL
);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [40]:
%sql mysql+mysqldb://kwik_analyst:rnXZT3El39g6IjVq:@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views

In [ ]:
pysocog
engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

In [ ]:
engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

In [ ]:
engine = create_engine('mysql+pymysql://kwik_analyst:rnXZT3El39g6IjVq:@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views')

In [12]:
 %load_ext sql

In [17]:
%sql SELECT * from EMPLOY;

 * sqlite://
Done.

[('Tom', 'Mitchell', 'm', 'Ikeja'), ('Jack', 'Ryan', 'f', 'Island')]

In [3]:
import pandas as pd
import numpy as np

In [4]:
user_name = os.environ.get('kwik_analyst')
password = os.environ.get('rnXZT3El39g6IjVq:')

In [7]:
kwik_views_table = pd.read_sql_query('SHOW TABLES FROM kwik_views', connection)

In [8]:
kwik_views_table

            Tables_in_kwik_views
0             tb_acl_entity_rule
1        tb_acl_rules_definition
2              tb_acl_user_rules
3                 tb_add_on_type
4                tb_app_settings
..                           ...
84       tb_vendor_fav_locations
85  tb_vendor_push_notifications
86                    tb_vendors
87                   tb_version2
88         tb_wallet_txn_history

[89 rows x 1 columns]

In [9]:
mycursor = connection.cursor()

In [10]:
mycursor.execute("select * from tb_jobs;")

In [11]:
results = mycursor.fetchall()

In [20]:
play = %sql select count(*) from tb_jobs

 * sqlite://
(sqlite3.OperationalError) no such table: tb_jobs
[SQL: select count(*) from tb_jobs]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [ ]:
cursor_table1.execute('insert into table2 (part, min, max, unitPrice, date) select part, min, max, unitPrice, now() from table1')

In [34]:
dfee = pd.read_sql_query("select order_id, job_id from tb_jobs;", connection)

In [35]:
dfee

             order_id  job_id
0                None      53
1                None      96
2                None      99
3                None     100
4                None     103
...               ...     ...
134468  {{vendor_id}}   12299
134469  {{vendor_id}}   12304
134470  {{vendor_id}}   12305
134471  {{vendor_id}}   12306
134472  {{vendor_id}}   12307

[134473 rows x 2 columns]

In [ ]:
df.to_sql('db_table2', engine, if_exists='replace')

In [29]:
dfcounter = pd.read_sql_query("select count(DISTINCT unique_order_id),order_id, job_date from tb_jobs inner join tb_task_view ON tb_jobs.pickup_delivery_relationship = tb_task_view.pickup_delivery_relationship where task_status != 2 group by job_date order by job_date;", connection)

In [ ]:
SELECT total_amount, order_id, job_date, unique_order_id, job_type FROM kwik_views.tb_jobs
INNER JOIN tb_task_view ON tb_jobs.pickup_delivery_relationship = tb_task_view.pickup_delivery_relationship
where task_status = 2;

In [55]:
%sql select * from tb_jobs

 * sqlite://
(sqlite3.OperationalError) no such table: tb_jobs
[SQL: select * from tb_jobs]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [15]:
dfcounta = pd.read_sql_query("select count(DISTINCT unique_order_id), job_date from tb_jobs where job_status != 2 group by job_date; order by job_date", connection)

In [ ]:
left = pd.DataFrame(newquick)

In [ ]:
right = pd.DataFrame(newquick)

In [45]:
test = pd.merge(dfcount,dfcounta,on='job_date')

In [17]:
allorder = pd.merge(dfcount,dfcounta,how ='outer', on ='job_date')

In [21]:
allorder['job_date'] =pd.to_datetime(df.job_date)

In [24]:
allorder.sort_values(by='job_date')

,count(DISTINCT unique_order_id)_x,job_date,count(DISTINCT unique_order_id)_y
0,1.0,2019-06-14,NaN
1,3.0,2019-06-14,NaN
2,3.0,2019-06-14,NaN
3,12.0,2019-06-14,3.0
4,11.0,2019-06-17,6.0
...,...,...,...
609,NaN,2019-07-29,3.0
611,NaN,2019-07-29,5.0
613,NaN,2019-07-30,4.0
612,NaN,2019-07-30,10.0
614,NaN,2019-07-30,1.0

In [19]:
allorder.to_csv('tasteorder.csv', index = False)

In [22]:
 %sql SELECT * from kwik_views_tb_vendors;

 * sqlite://
(sqlite3.OperationalError) no such table: kwik_views_tb_vendors
[SQL: SELECT * from kwik_views_tb_vendors;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [32]:
 %load_ext sql

In [28]:
%reload_ext sql

In [15]:
%sql sqlite://

In [10]:
%%sql   
CREATE TABLE EMPLOR(firstname varchar(50),lastname varchar(50), gender string, location varchar(50));  
INSERT INTO EMPLOY VALUES('Tom','Mitchell', 'm','Ikeja');  
INSERT INTO EMPLOY VALUES('Jack','Ryan','f', 'Island');

 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
(MySQLdb._exceptions.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'string, location varchar(50))' at line 1")
[SQL: CREATE TABLE EMPLOR(firstname varchar(50),lastname varchar(50), gender string, location varchar(50));]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [11]:
%sql SELECT * from EMPLOY;

 * mysql+mysqldb://kwik_analyst:***@replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com/kwik_views
(MySQLdb._exceptions.ProgrammingError) (1146, "Table 'kwik_views.EMPLOY' doesn't exist")
[SQL: SELECT * from EMPLOY;]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [66]:
%%sql   
CREATE TABLE sereney
(
 first_name varchar(55) NOT NULL,
 last_name varchar(55)  NOT NULL
);

 * sqlite://
Done.

[]

In [67]:
%sql SELECT * from sereney;

 * sqlite://
Done.

[]

In [21]:
%%sql   
CREATE TABLE Samplu
(date_key integer NOT NULL PRIMARY KEY,
 date date NOT NULL,
 year smallint NOT NULL,
 quarter smallint NOT NULL,
 month smallint NOT NULL,
 day smallint NOT NULL,
 week smallint NOT NULL,
 first_name varchar(55) NOT NULL,
 last_name varchar(55)  NOT NULL
);

 * sqlite://
Done.

[]

In [39]:
%%sql   
CREATE TABLE Sarah
(sales_key SERIAL PRIMARY KEY,
 date_key INT NOT NULL REFERENCES dimdate(date_key),
 customer_key INT NOT NULL REFERENCES dimcustomer(customer_key),
 movie_key INT NOT NULL REFERENCES dimmovie(movie_key),
 sales_amount decimal(5,2) NOT NULL
);

 * sqlite://
Done.

[]

In [22]:
%sql SELECT * from Samplu;

 * sqlite://
Done.

[]

In [68]:
%%sql 
INSERT INTO sereney (first_name,last_name)
SELECT first_name,last_name FROM EMPLOY;

 * sqlite://
(sqlite3.OperationalError) no such column: first_name
[SQL: INSERT INTO sereney (first_name,last_name)
SELECT first_name,last_name FROM EMPLOY;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [51]:
 %sql SELECT * from EMPLOY;

 * sqlite://
Done.

[('Tom', 'Mitchell', 'm', 'Ikeja'), ('Jack', 'Ryan', 'f', 'Island')]

In [54]:
%sql select * from tb_jobs

 * sqlite://
(sqlite3.OperationalError) no such table: tb_jobs
[SQL: select * from tb_jobs]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [ ]:
cur.execute("select * from airlines limit 5;")

In [9]:
mySQLuser = 'kwik_analyst'
mySQLpasswd = 'rnXZT3El39g6IjVq:'
mySQLhost = 'replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com'
mySQLport = '3306'
mySQLdatabase = 'kwik_views'

In [2]:
connection = pymysql.connect(user = kwik_analyst, passwd = rnXZT3El39g6IjVq:, host = replica-kwik.cm7vjdla27em.eu-west-2.rds.amazonaws.com, port = 3306, db = kwik_views)

In [10]:
mySQLuser = 'root'
mySQLpasswd = 'betaalpha@@1990'
mySQLhost = 'localhost'
mySQLport = '3306'
mySQLdatabase = 'kwikhost'

In [12]:
%load_ext sql

In [13]:
%sql sqlite://